* HA Proxy reload; how to go from 30s -> 1s
** HA-Proxy reload optimisation merged upstream

https://git.haproxy.org/?p=haproxy.git;a=commit;h=f91ac19299fe216a793ba6550dca06b688b31549

** It may get an official backport to 2.0

https://www.mail-archive.com/haproxy@formilux.org/msg36536.html

** I have a PR that carries this patch in a build of haproxy-2.1

https://github.com/openshift/router/pull/89

* Live Demo || Friday 13th

** haproxy-2.1 builds

   #+BEGIN_SRC sh :results pp
   (cd ~/git.haproxy.org/haproxy-2.1; git log -n 1 | head -n 5)
   #+END_SRC

   #+RESULTS:
   : commit ce757fa24f47852ccf0308193e546b585445f7e3
   : Author: Christopher Faulet <cfaulet@haproxy.com>
   : Date:   Fri Feb 21 10:20:46 2020 +0100
   : 
   :     BUG/MAJOR: http-ana: Always abort the request when a tarpit is triggered

   #+BEGIN_SRC sh :results pp
    ~/git.haproxy.org/haproxy-2.1/haproxy -v | head -n 1
   #+END_SRC

   #+RESULTS:
   : HA-Proxy version 2.1.3-ce757f-13 2020/02/21 - https://haproxy.org/

** haproxy-2.1 with the optimisation build

   #+BEGIN_SRC sh :results pp
   (cd ~/git.haproxy.org/haproxy-2.1-with-optim-patch; git log -n 1 | head -n 5)
   #+END_SRC

   #+RESULTS:
   : commit 8c7e0f0d60841577b0acd5c8d5344de32ee137ac
   : Author: Carl Henrik Lunde <carl.henrik.lunde@sparebank1.no>
   : Date:   Thu Feb 27 16:45:50 2020 +0100
   : 
   :     OPTIM: startup: fast unique_id allocation for acl.

   #+BEGIN_SRC sh :results value
   ~/git.haproxy.org/haproxy-2.1-with-optim-patch/haproxy -v | head -n 1
   #+END_SRC

   #+RESULTS:
   : HA-Proxy version 2.1.3-8c7e0f-14 2020/03/13 - https://haproxy.org/

** How many backend/routes in our config?

   #+BEGIN_SRC sh :results pp
   wc -l var/lib/haproxy/conf/os_http_be.map
   #+END_SRC

   #+RESULTS:
   : 3000 var/lib/haproxy/conf/os_http_be.map

   #+BEGIN_SRC sh :results pp
   grep '^backend' ./var/lib/haproxy/conf/haproxy.config  |wc -l
   #+END_SRC

   #+RESULTS:
   : 3010

** Going to 13K routes

   #+BEGIN_SRC sh :results pp
   ./make-additional-backends.bash >> var/lib/haproxy/conf/haproxy.config
   ./make-additional-map-entries.bash  >> var/lib/haproxy/conf/os_http_be.map
   #+END_SRC

   #+BEGIN_SRC sh :results pp
   wc -l var/lib/haproxy/conf/os_http_be.map
   #+END_SRC

   #+RESULTS:
   : 13000 var/lib/haproxy/conf/os_http_be.map

   #+BEGIN_SRC sh :results pp
   grep '^backend' ./var/lib/haproxy/conf/haproxy.config  |wc -l
   #+END_SRC

   #+RESULTS:
   : 13010

* Summary

** Using unpatched haproxy

  Time to reload 3K routes: 1.9s
  Time to reload 13K routes: 47s

** Using patched haproxy

  Time to reload 3K routes: 0.3s
  Time to reload 13K routes: 1.1s


* Results

Reload time in seconds

| #Routes | 2.0.13 reload(s) | 2.0.14 reload(s) |
|---------+------------------+------------------|
|     300 |              1.7 |              0.2 |
|   13000 |             33.0 |              0.8 |
